gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    PE
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       34735;
    }
    DI
    {
        type            wall;
        inGroups        1(wall);
        nFaces          46;
        startFace       34875;
    }
    NE
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       34921;
    }
    INLET
    {
        type            patch;
        nFaces          102;
        startFace       35061;
    }
    OUTLET
    {
        type            patch;
        nFaces          102;
        startFace       35163;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          35000;
        startFace       35265;
    }
)

// ************************************************************************* //
