gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

//internalField   uniform (0 0.518 0);//1400ml/min
internalField   uniform (0 0.74 0);//200ml/min


boundaryField
{
    PE
    {
        type            noSlip;
    }

    DI
    {
        type            noSlip;
    }
    NE
    {
        type            noSlip;
    }

    INLET
    {
    	//type	zeroGradient;
        type            fixedValue;
        value		$internalField;
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 0.833e-6;
        //type 			fixedMean;
        //meanValue		constant (VEX VEY VEZ);
        //value			$internalField;
    }

    OUTLET
    {
        type            zeroGradient;
    }


    frontAndBack
    {
	type		empty;
    }

}


// ************************************************************************* //
