gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/0.orig/C_O2.electrolyte
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 1e-4;

boundaryField
{
    PE
    {
	type		zeroGradient;
    }
    DI
    {
	type		zeroGradient;
    }
    NE
    {
	type		zeroGradient;
    }

    INLET
    {
    	type		fixedValue;
    	value		uniform 1e-4;
    }
    OUTLET
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }


}


// ************************************************************************* //
