gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/0.orig/UNe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      UNe;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform -1.4;



boundaryField
{
    PE
    {
	type		zeroGradient;
    }
    DI
    {
	type		zeroGradient;
    }
    NE
    {
    type            uniformFixedValue;
    uniformValue    table
    (
        (0 -1.4) (0.25 -1.25)(0.5 -1.5)(0.75 -1.75)(1 -2)(1.5 -2.2)(2 -2.4)
    );

    }

    INLET
    {
    	type		zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }

}


// ************************************************************************* //
