gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/0.orig/Udm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    PE
    {
        type            noSlip;
    }

    DI
    {
        type            noSlip;
    }
    NE
    {
        type            noSlip;
    }

    INLET
    {
        type            zeroGradient;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }

}


// ************************************************************************* //
