gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/0.orig/V2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      V2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;


boundaryField
{
    PE
    {
        type            fixedValue;
        value		uniform 0;
    }
    DI
    {
	type		zeroGradient;
    }
    NE
    {
        type            fixedValue;
        value		uniform 0;
    }

    INLET
    {
    	type		zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }

}



// ************************************************************************* //
