gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/0.orig/eta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      eta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
set_poredensity						110;
set_poresize						0.0002;
set_tortuosity						1.2;
set_specificsurfacearea 			11784.13761189054;
set_viscosity						0.002;
set_porosity						0.589206880594527;
set_permeability					1.7289712861491538e-10;
set_d								11567572.09342958;
*/

set_poredensity						110;
set_poresize						0.0002;
set_tortuosity						1.2;
set_specificsurfacearea 			11784.13761189054;
set_viscosity						0.002;
set_porosity						0.589206880594527;
set_permeability					1.7289712861491538e-10;
set_d								11567572.09342958;



dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    PE
    {
	type		zeroGradient;
    }
    DI
    {
	type		zeroGradient;
    }
    NE
    {
	type		zeroGradient;
    }

    INLET
    {
    	type		zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }


}


// ************************************************************************* //
