gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/system/foamToVTKDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      foamToVTKDict;
}

// Enable cell zone export
writeCellZones yes;
writeZones yes;
writeSets yes;
writeBoundary yes;
