gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/system/sampleDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 2206                                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

// Choose an interpolation scheme
interpolationScheme cellPoint;

// Define sets to sample. Adjust the geometry as needed.
sets
(
    zoneIDSet
    {
        type            uniform;
        axis            xyz;
        start           (0 0 0);
        end             (1 1 1);
        nPoints         (100);
        // You can try including this key if needed:
        // setFormat       ascii;
    }
);

// Specify which fields to sample
fields
(
    zoneID
);
