gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/system/setsToZonesDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setsToZonesDict;
}

// List the cell sets you wish to convert to zones
cellSets
(
    porous_PE
    porous_DI
    porous_NE
);
