gitcases/AWE_SIMPLE_NOCHANNEL_2D_foamfoam/system/topoSet_porousDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

//Start of Defining parametric variables //

H   	30.0e-3;//cell HEIGHT in Y-direction
W		30.0e-3;//cell WIDTH in Z-direction


tp		1.5e-3; //thickness of positive electrode
tdi		0.5e-3; //thickness of diaphragm
tn		1.5e-3; //thickness of negative electrode
tnfoam 	1.5e-3;


z0		0;
z1  	30e-3;//cell depth in Z-direction


//Start of cumulative thickness calculation for each layer//

t1 #eval #{ $tp+$tdi #};//cumulative thickness of (positive electrode + di)
t2 #eval #{ $t1+$tn #};//cumulative thickness of  (positive electrode + di +negative electrode)
t3 #eval #{ $t2+$tnfoam #};//cumulative thickness of  (positive electrode + di +negative electrode+negative electrode1)

//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//
actions
(

    // Positive Electrode (PE)
    {
        name    PEset;
        type    cellSet;
        action  new;
        source  boxToCell;
        boxes
        (
            (0 0 $z0) ($tp $H $z1)
        );
    }
    {
        name    PE;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     PEset;
    }

    // Diaphragm (DI)
    {
        name    DIset;
        type    cellSet;
        action  new;
        source  boxToCell;
        boxes
        (
            ($tp 0 $z0) ($t1 $H $z1)
        );
    }
    {
        name    DI;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     DIset;
    }

    // Negative Electrode (NE)
    // Instead of separately creating NE1 and NE2 and then uniting them,
    // we define one cellSet that spans the entire NE region.
    {
        name    NEset;
        type    cellSet;
        action  new;
        source  boxToCell;
        boxes
        (
            ($t1 0 $z0) ($t3 $H $z1)
        );
    }
    {
        name    NE;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     NEset;
    }

);
//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//
